---
kind: type
id: T:Autodesk.Revit.DB.GridNodeLocation
source: html/82806a64-e5cf-9c78-675a-9d5ca11bf4b1.htm
---
# Autodesk.Revit.DB.GridNodeLocation

Location of a grid node relative to the face boundary.
See DividedSurface .

## Syntax (C#)
```csharp
public enum GridNodeLocation
```